xml2map/src/test/resources/org/dbondin/xml2map/jms-00007.xml

<?xml version="1.0"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP:Header>
    <header xmlns="xmlapi_1.0">
      <eventName>ObjectDeletion</eventName>
      <ALA_category>FAULT</ALA_category>
      <ALA_OLC>2</ALA_OLC>
      <ALA_isVessel>false</ALA_isVessel>
      <ALA_allomorphic>fm.AlarmObject</ALA_allomorphic>
      <MTOSI_osTime>1439367318074</MTOSI_osTime>
      <MTOSI_NTType>NT_ALARM</MTOSI_NTType>
      <MTOSI_objectName>faultManager:network@82.213.55.39@shelf-1@cardSlot-1@card@daughterCardSlot-1@daughterCard@port-4@ddm|alarm-489-49-375</MTOSI_objectName>
      <ALA_span>:2:</ALA_span>
      <ALA_clientId/>
      <MTOSI_objectType>fm.AlarmObject</MTOSI_objectType>
      <ALA_eventName>ObjectDeletion</ALA_eventName>
    </header>
  </SOAP:Header>
  <SOAP:Body>
    <jms xmlns="xmlapi_1.0">
      <objectDeletionEvent>
        <objectFullName>faultManager:network@82.213.55.39@shelf-1@cardSlot-1@card@daughterCardSlot-1@daughterCard@port-4@ddm|alarm-489-49-375</objectFullName>
        <alarmDetail>
          <fm.AlarmInfo>
            <severity>cleared</severity>
            <previousSeverity>major</previousSeverity>
            <originalSeverity>major</originalSeverity>
            <highestSeverity>major</highestSeverity>
            <probableCause>375</probableCause>
            <alarmName>489</alarmName>
            <type>49</type>
            <affectedObjectFullName>network:82.213.55.39:shelf-1:cardSlot-1:card:daughterCardSlot-1:daughterCard:port-4:ddm</affectedObjectFullName>
            <affectedObjectClassName>equipment.DigitalDiagnosticMonitoring</affectedObjectClassName>
            <isAcknowledged>false</isAcknowledged>
            <wasAcknowledged>false</wasAcknowledged>
            <acknowldegedBy>N/A</acknowldegedBy>
            <clearedBy>N/A</clearedBy>
            <deletedBy>N/A</deletedBy>
            <firstTimeDetected>1439098273416</firstTimeDetected>
            <lastTimeDetected>1439098273416</lastTimeDetected>
            <lastTimeSeverityChanged>1439367318069</lastTimeSeverityChanged>
            <lastTimeCleared>1439367318069</lastTimeCleared>
            <lastTimePromoted>0</lastTimePromoted>
            <lastTimeDemoted>1439367318069</lastTimeDemoted>
            <lastTimeEscalated>0</lastTimeEscalated>
            <lastTimeDeEscalated>0</lastTimeDeEscalated>
            <lastTimeAcknowledged>0</lastTimeAcknowledged>
            <nodeTimeOffset>-1</nodeTimeOffset>
            <frequency>0</frequency>
            <occurences/>
            <numberOfOccurences>1</numberOfOccurences>
            <numberOfOccurencesSinceClear>0</numberOfOccurencesSinceClear>
            <numberOfOccurencesSinceAck>0</numberOfOccurencesSinceAck>
            <isServiceAffecting>false</isServiceAffecting>
            <additionalText>N/A</additionalText>
            <operatorAssignedUrgency>indeterminate</operatorAssignedUrgency>
            <urgencyAssignedBy>N/A</urgencyAssignedBy>
            <relatedObjects>
              <null/>
            </relatedObjects>
            <affectingObjects>
              <null/>
            </affectingObjects>
            <subscriberId>0</subscriberId>
            <nodeId>82.213.55.39</nodeId>
            <nodeName>SAS-84-RML006-AL-SUM-BUKM</nodeName>
            <affectedObjectDisplayedName>ddm</affectedObjectDisplayedName>
            <applicationDomain>Physical Equipment</applicationDomain>
            <displayedClass>DigitalDiagnosticMonitoring</displayedClass>
            <alarmClassTag>equipment.DDMRxOpticalPowerLowAlarm</alarmClassTag>
            <affectedObjectClassIndex>2244</affectedObjectClassIndex>
            <affectedObjectInstanceIndex>23914</affectedObjectInstanceIndex>
            <correlatingAlarm>N/A</correlatingAlarm>
            <isImplicitlyCleared>true</isImplicitlyCleared>
            <numberOfCorrelatedAlarms>0</numberOfCorrelatedAlarms>
            <olcState>inService</olcState>
            <objectFullName>faultManager:network@82.213.55.39@shelf-1@cardSlot-1@card@daughterCardSlot-1@daughterCard@port-4@ddm|alarm-489-49-375</objectFullName>
            <objectClassName>fm.AlarmObject</objectClassName>
            <allomorphicClassName>fm.AlarmObject</allomorphicClassName>
            <objectId>26653094</objectId>
            <displayedName>ddm - network@82.213.55.39@shelf-1@cardSlot-1@card@daughterCardSlot-1@daughterCard@port-4@ddm|alarm-489-49-375</displayedName>
            <lifeCycleState>2</lifeCycleState>
            <deploymentState>0</deploymentState>
            <neId>82.213.55.39</neId>
            <spanObjectPointer>node-82.213.55.39</spanObjectPointer>
            <parentClassName>fm.FaultManager</parentClassName>
            <unsetProperties/>
          </fm.AlarmInfo>
        </alarmDetail>
      </objectDeletionEvent>
    </jms>
  </SOAP:Body>
</SOAP:Envelope>
